Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <module name="CFG" id="chip_cfg_pb" name2="chip_cfg_pb" version="A">
          <instance name="CFG">
            <register-group name="CFG" name-in-module="CFG" address-space="base" offset="0x44000000"/>
          </instance>
        </module>
        <module name="CMCC" id="04727" name2="ram_cmcc_u2015_v7" version="A">
          <instance name="CMCC">
            <register-group name="CMCC" name-in-module="CMCC" address-space="base" offset="0x41002000"/>
          </instance>
        </module>
        <module name="CRU" id="03100" name2="clk_cru_upb_v3" version="A">
          <instance name="CRU">
            <register-group name="CRU" name-in-module="CRU" address-space="base" offset="0x44000A00"/>
          </instance>
        </module>
        <module name="CVD" id="05033" name2="adc_cvd_ctrl_upb_v2" version="Rev A.1">
          <instance name="CVD">
            <register-group name="CVD" name-in-module="CVD" address-space="base" offset="0x44002400"/>
            <signals>
              <signal group="CVDR" index="0" function="ADC" pad="PB4"/>
              <signal group="CVDR" index="1" function="ADC" pad="PB5"/>
              <signal group="CVDR" index="2" function="ADC" pad="PB6"/>
              <signal group="CVDR" index="3" function="ADC" pad="PB7"/>
              <signal group="CVDT" index="0" function="ADC" pad="PB4"/>
              <signal group="CVDT" index="1" function="ADC" pad="PB5"/>
              <signal group="CVDT" index="2" function="ADC" pad="PB6"/>
              <signal group="CVDT" index="3" function="ADC" pad="PB7"/>
            </signals>
            <parameters>
              <param name="CVD_AN_MAX" value="3" caption="Highest AN input on the device used for CVD. The channels must be a subset or equal to the shared ADC input channels. Max of 63"/>
              <param name="CVD_AN_MIN" value="0" caption="Highest AN input on the device used for CVD. The channels must be a subset or equal to the shared ADC input channels."/>
              <param name="CVD_TX_NUM" value="8" caption="Number of TX outputs on the device. Max of 64"/>
              <param name="CVD_FIFO_DEPTH" value="8" caption="Number of words in the UPB FIFO. Max is 1KThe depth of the UPB FIFO is limited to &quot;powers of 2&quot;.Allowable values are: 8, 16, 32, 64, 128, 256, 512, 1K"/>
              <param name="ADCBITS" value="12" caption="Number of bits in the ADC data. Max is 16-bit."/>
              <param name="NUM_RX" value="4" caption="Number of RX Indexes. Valid settings are multiples of 4, and must be equal to or greater than 1+CVD_AN_MAX-CVD_AN_MIN"/>
              <param name="NUM_TX" value="4" caption="Number of TX Indexes. Valid settings are multiples of 4"/>
              <param name="UPB_ADDRL" value="2400" caption="Start address of UPB registers"/>
              <param name="NUM_ADC" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
          </instance>
        </module>
        <module name="DAC_CTRL" id="05063" name2="dac_7bit_ctrl_v1" version="A.3 Draft">
          <instance name="DAC_CTRL">
            <register-group name="DAC_CTRL" name-in-module="DAC_CTRL" address-space="base" offset="0x44003C00"/>
            <signals>
              <signal group="DACOUT" function="DAC" pad="PA3"/>
            </signals>
          </instance>
        </module>
        <module name="DGI_SPI" id="04366" name2="spi_dma_dgi_v1" version="0.1 Draft">
          <instance name="DGI_SPI">
            <register-group name="DGI_SPI" name-in-module="DGI_SPI" address-space="base" offset="0x44003E00"/>
            <signals>
              <signal group="DGI_SCK" function="SPI" pad="PA10"/>
              <signal group="DGI_SDO" function="SPI" pad="PA9"/>
              <signal group="DGI_SSN" function="SPI" pad="PA4"/>
            </signals>
            <parameters>
              <param name="PB_ADDRL" value="0x3E00"/>
              <param name="PB_ADDRH" value="0x3FFF"/>
            </parameters>
          </instance>
        </module>
        <module name="DMAC" id="04587" name2="dma_u2503_v2" version="A">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="34"/>
              <param name="TRIG_NUM" value="53"/>
              <param name="DMA_EVIN_NUM" value="8"/>
              <param name="DMA_CH_NUM" value="16"/>
              <param name="DMA_EVOUT_NUM" value="4"/>
              <param name="DMA_FIFO_SIZE" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="DMT" id="01520" name2="wdt_dmt_upb_v1" version="0.1 Draft">
          <instance name="DMT">
            <register-group name="DMT" name-in-module="DMT" address-space="base" offset="0x44000E00"/>
            <parameters>
              <param name="UPB_ADDRL" value="0" caption="See Table 3-20"/>
              <param name="HOLDREG_PRESENT" value="0" caption="Used for 16 bit devices only"/>
            </parameters>
          </instance>
        </module>
        <module name="DSCON" id="04824" name2="lpwr_xdpslp_ctrl_v2" version="A">
          <instance name="DSCON">
            <register-group name="DSCON" name-in-module="DSCON" address-space="base" offset="0x42011000"/>
          </instance>
        </module>
        <module name="DSU" id="05006" name2="icd_dsu_u2410_v4" version="A">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="PERM_ADDR_START1" value="0x4400_0600" caption="Permissible address range start"/>
              <param name="PERM_ADDR_END1" value="0x4400_07FF" caption="Permissible address range end"/>
              <param name="PERM_ADDR_START2" value="0x4400_2C00" caption="Second permissible address range start"/>
              <param name="PERM_ADDR_END2" value="0x4400_3BFF" caption="Second permissible address range end"/>
              <param name="FLASH_ADDR_START" value="0x0080_0000" caption="Flash address start"/>
              <param name="FLASH_ADDR_END" value="0x0107_FFFF" caption="Flash address end"/>
              <param name="DMAC_ID_DCC0" value="2"/>
              <param name="DMAC_ID_DCC1" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
