Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
          </instance>
        </module>
        <module name="EIC" id="04714" name2="int_eic_u2254_v4" version="A">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="EXTINT" index="0" function="1" pad="PA03" ioset="1"/>
              <signal group="EXTINT" index="0" function="2" pad="PA07" ioset="1"/>
              <signal group="EXTINT" index="0" function="5" pad="PB04" ioset="1"/>
              <signal group="EXTINT" index="0" function="6" pad="PB08" ioset="1"/>
              <signal group="EXTINT" index="0" function="9" pad="PA06" ioset="1"/>
              <signal group="EXTINT" index="0" function="10" pad="PA10" ioset="1"/>
              <signal group="EXTINT" index="0" function="13" pad="PB07" ioset="1"/>
              <signal group="EXTINT" index="0" function="15" pad="PA09" ioset="1"/>
              <signal group="EXTINT" index="1" function="1" pad="PA04" ioset="2"/>
              <signal group="EXTINT" index="1" function="2" pad="PA08" ioset="2"/>
              <signal group="EXTINT" index="1" function="5" pad="PB05" ioset="2"/>
              <signal group="EXTINT" index="1" function="6" pad="PB09" ioset="2"/>
              <signal group="EXTINT" index="1" function="8" pad="PA03" ioset="2"/>
              <signal group="EXTINT" index="1" function="9" pad="PA07" ioset="2"/>
              <signal group="EXTINT" index="1" function="12" pad="PB04" ioset="2"/>
              <signal group="EXTINT" index="1" function="13" pad="PB08" ioset="2"/>
              <signal group="EXTINT" index="2" function="1" pad="PA05" ioset="3"/>
              <signal group="EXTINT" index="2" function="2" pad="PA09" ioset="3"/>
              <signal group="EXTINT" index="2" function="5" pad="PB06" ioset="3"/>
              <signal group="EXTINT" index="2" function="8" pad="PA04" ioset="3"/>
              <signal group="EXTINT" index="2" function="9" pad="PA08" ioset="3"/>
              <signal group="EXTINT" index="2" function="12" pad="PB05" ioset="3"/>
              <signal group="EXTINT" index="2" function="13" pad="PB09" ioset="3"/>
              <signal group="EXTINT" index="3" function="1" pad="PA06" ioset="4"/>
              <signal group="EXTINT" index="3" function="2" pad="PA10" ioset="4"/>
              <signal group="EXTINT" index="3" function="5" pad="PB07" ioset="4"/>
              <signal group="EXTINT" index="3" function="8" pad="PA05" ioset="4"/>
              <signal group="EXTINT" index="3" function="9" pad="PA09" ioset="4"/>
              <signal group="EXTINT" index="3" function="12" pad="PB06" ioset="4"/>
              <signal group="EXTINT" index="3" function="14" pad="PA08" ioset="4"/>
              <signal group="NMI" function="1" pad="PA06" ioset="4"/>
              <signal group="NMI" function="2" pad="PA10" ioset="4"/>
              <signal group="NMI" function="5" pad="PB07" ioset="4"/>
              <signal group="NMI" function="8" pad="PA05" ioset="4"/>
              <signal group="NMI" function="9" pad="PA09" ioset="4"/>
              <signal group="NMI" function="12" pad="PB06" ioset="4"/>
              <signal group="NMI" function="14" pad="PA08" ioset="4"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
              <param name="CHIP_EIC_PADDR_MSB" value="9"/>
              <param name="CHIP_EIC_EXTINT_NUM" value="4"/>
              <param name="CHIP_EIC_NMISENSE_DEFAULT_VALUE" value="0"/>
              <param name="CHIP_EIC_NMI_FORCE_DETECTION" value="0"/>
              <param name="CHIP_EIC_NUMBER_OF_CONFIG_REGS" value="1" caption="(CHIP_EIC_EXTINT_NUM+7)/8"/>
              <param name="CHIP_EIC_NUMBER_OF_DPRESCALER_REGS" value="1" caption="(CHIP_EIC_EXTINT_NUM+7)/8"/>
              <param name="CHIP_EIC_NUMBER_OF_INTERRUPTS" value="4" caption="CHIP_EIC_EXTINT_NUM"/>
              <param name="GCLK_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <!--
		<module name="EFUSE" id="EIP_00504" version="1.0.0">
		  <instance name="EFUSE">
            <register-group name="EFUSE" name-in-module="EFUSE" address-space="fuses" offset="0x0" />
          </instance>
        </module>
		-->
        <module name="ETM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="EVSYS" id="04712" name2="ptg_evsys_u2504_v3" version="A">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
              <param name="CHIP_EVSYS_PADDR_MSB" value="12"/>
              <param name="CHIP_EVSYS_EXTEVT_NUM" value="0"/>
              <param name="CHIP_EVSYS_ASYNCHRONOUS_CHANNELS" value="0xFFFFF000"/>
              <param name="CHIP_EVSYS_CHANNELS" value="32"/>
              <param name="CHIP_EVSYS_GENERATORS" value="81"/>
              <param name="CHIP_EVSYS_SYNCH_NUM" value="12"/>
              <param name="CHIP_EVSYS_USERS" value="57"/>
              <param name="CHIP_EVSYS_CHANNELS_BITS" value="5"/>
              <param name="CHIP_EVSYS_GENERATORS_BITS" value="7"/>
              <param name="CHIP_EVSYS_SYNCH_NUM_BITS" value="4"/>
              <param name="CHIP_EVSYS_USERS_BITS" value="6"/>
              <param name="GCLK_ID_0" value="8"/>
              <param name="GCLK_ID_1" value="9"/>
              <param name="GCLK_ID_2" value="10"/>
              <param name="GCLK_ID_3" value="11"/>
              <param name="GCLK_ID_4" value="12"/>
              <param name="GCLK_ID_5" value="13"/>
              <param name="GCLK_ID_6" value="14"/>
              <param name="GCLK_ID_7" value="15"/>
              <param name="GCLK_ID_8" value="16"/>
              <param name="GCLK_ID_9" value="17"/>
              <param name="GCLK_ID_10" value="18"/>
              <param name="GCLK_ID_11" value="19"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
