Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
          </instance>
        </module>
        <module name="FREQM" id="04703" name2="clk_freqm_u2257_v4" version="A">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
              <param name="GCLK_ID_MSR" value="2"/>
              <param name="GCLK_ID_REF" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="A">
          <instance name="FUSES">
            <register-group name="FUSES_DEVICECFG" name-in-module="FUSES_DEVICECFG" address-space="base" offset="0x00805E80"/>
          </instance>
        </module>
        <module name="GPIO" id="02467" name2="gpio_ports_upb_v1" version="A">
          <instance name="GPIOA">
            <register-group name="GPIOA" name-in-module="GPIO" address-space="base" offset="0x44002A00"/>
            <signals>
              <signal group="IOCA" index="3" function="CHANGE_NOTIFICATION" pad="PA3"/>
              <signal group="IOCA" index="4" function="CHANGE_NOTIFICATION" pad="PA4"/>
              <signal group="IOCA" index="5" function="CHANGE_NOTIFICATION" pad="PA5"/>
              <signal group="IOCA" index="6" function="CHANGE_NOTIFICATION" pad="PA6"/>
              <signal group="IOCA" index="7" function="CHANGE_NOTIFICATION" pad="PA7"/>
              <signal group="IOCA" index="8" function="CHANGE_NOTIFICATION" pad="PA8"/>
              <signal group="IOCA" index="9" function="CHANGE_NOTIFICATION" pad="PA9"/>
              <signal group="IOCA" index="10" function="CHANGE_NOTIFICATION" pad="PA10"/>
              <signal group="RA" index="3" function="PORT_I_O" pad="PA3"/>
              <signal group="RA" index="4" function="PORT_I_O" pad="PA4"/>
              <signal group="RA" index="5" function="PORT_I_O" pad="PA5"/>
              <signal group="RA" index="6" function="PORT_I_O" pad="PA6"/>
              <signal group="RA" index="7" function="PORT_I_O" pad="PA7"/>
              <signal group="RA" index="8" function="PORT_I_O" pad="PA8"/>
              <signal group="RA" index="9" function="PORT_I_O" pad="PA9"/>
              <signal group="RA" index="10" function="PORT_I_O" pad="PA10"/>
            </signals>
          </instance>
          <instance name="GPIOB">
            <register-group name="GPIOB" name-in-module="GPIO" address-space="base" offset="0x44002B00"/>
            <signals>
              <signal group="IOCB" index="4" function="CHANGE_NOTIFICATION" pad="PB4"/>
              <signal group="IOCB" index="5" function="CHANGE_NOTIFICATION" pad="PB5"/>
              <signal group="IOCB" index="6" function="CHANGE_NOTIFICATION" pad="PB6"/>
              <signal group="IOCB" index="7" function="CHANGE_NOTIFICATION" pad="PB7"/>
              <signal group="IOCB" index="8" function="CHANGE_NOTIFICATION" pad="PB8"/>
              <signal group="IOCB" index="9" function="CHANGE_NOTIFICATION" pad="PB9"/>
              <signal group="RB" index="4" function="PORT_I_O" pad="PB4"/>
              <signal group="RB" index="5" function="PORT_I_O" pad="PB5"/>
              <signal group="RB" index="6" function="PORT_I_O" pad="PB6"/>
              <signal group="RB" index="7" function="PORT_I_O" pad="PB7"/>
              <signal group="RB" index="8" function="PORT_I_O" pad="PB8"/>
              <signal group="RB" index="9" function="PORT_I_O" pad="PB9"/>
            </signals>
          </instance>
        </module>
        <module name="HMATRIX2TOP" id="04585" name2="hmatrix2_v6" version="A">
          <instance name="HMATRIX2TOP">
            <register-group name="HMATRIX2TOP" name-in-module="HMATRIX2TOP" address-space="base" offset="0x42002400"/>
            <parameters>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="40" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="3" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="NVM" id="03140" name2="pfm_ctrl_32bit_upb_v4" version="A">
          <instance name="NVM">
            <register-group name="NVM" name-in-module="NVM" address-space="base" offset="0x44000600"/>
            <parameters>
              <param name="PFM_ADDR_BASE" value="0x0100_0000" caption="Physical Start address of Program Flash Memory in KSEG0/KSEG1 (system address). Address must be aligned to the PFM size. Refer Table 3-23"/>
              <param name="BOOT_ADDR_BASE" value="0x0080_0000" caption="Physical Start address of boot flash memory (system address). Address must be aligned to the NVR size."/>
              <param name="BOOT_ADDR_END" value="0x0080_5FFF" caption="Physical End address of boot flash memory (system address)"/>
              <param name="OTP_ADDR_BASE" value="0x0080_6000" caption="Physical Start address of OTP page flash memory (system address)"/>
              <param name="NVR_ADDR_END" value="0x0080_7FFF" caption="Physical End address of secure boot flash memory (system address)"/>
              <param name="TEST_ADDR_BASE" value="0x0084_7000" caption="Physical Base address of Test page flash memory (systemaddress)."/>
              <param name="TEST_ADDR_END" value="0x0084_7FFF" caption="Physical End address of test flash memory (system address)"/>
              <param name="PFM_SYS_ADDR_MSB" value="18" caption="The MS bit of the system address needed to address all flash memory. Used by Flash BIST. MSB of 19 = 2^20 = 1MB"/>
              <param name="FIXED_BOOT_SEL_BIT" value="18" caption="The highest bit position that allows address decode to differentiate between fixed and aliased NVR address space. When set, this bit will select fixed NVR space."/>
              <param name="NVR_PANEL_SEL_BIT" value="17" caption="The highest bit position that allows address decode to differentiate between NVR address space in Panel 1 and Panel 2 (if supported).Note: The value for NVR_PANEL_SEL_BIT will typically be FIXED_BOOT_SEL_BIT-1"/>
              <param name="F1RR_ADDR" value="0x0084_7FFF" caption="System physical address of Panel 1's first Redundancy Record.Typically TEST_ADDR_END"/>
              <param name="F2RR_ADDR" value="0x0004_7FDF" caption="System physical address of Panel 2's first RedundancyRecord.Typically F1RR_ADDR-(32*RR_NUM_WORDS)"/>
              <param name="TCFG_ADDR" value="0x0084_7FBF" caption="System physical address of first TCFG data.Typically F2RR_ADDR-(32*RR_NUM_WORDS)"/>
              <param name="SEQNUM_ADDR" value="0x0084_5FFF" caption="System physical address of Panel 1's Sequence Number.Typically BOOT_ADDR_END."/>
              <param name="SIGN_ADDR" value="0x0084_5FDF" caption="System physical address of SIGNTypically SEQNUM_ADDR-32."/>
              <param name="CP_ADDR" value="0x0084_5FBF" caption="System physical address CPTypically SIGN_ADDR-32."/>
              <param name="BCFG_ADDR" value="0x0084_5F9F" caption="System physical address of first BCFG data.Typically CP_ADDR-32."/>
              <param name="BCFG_PAGE" value="5" caption="NVR page contain BCFG data. The page must be consistent with the BCFG_ADDR[] parameter."/>
              <param name="TCFG_PAGE" value="7" caption="NVR page contain TCFG data. The page must be consistent with the TCFG_ADDR[] parameter."/>
              <param name="NVMOTP_PAGE" value="6" caption="NVR page contain OTP data. The page must be consistentwith the OTP_ADDR_BASE[] parameter."/>
              <param name="ALT_CFG_SEL_BIT" value="8" caption="Bit number to toggle in Main BCFG or TCFG address to generate the equivalent address within the Alternate BCFG or TCFG space.Used in the event of an (unrecoverable) ECC DED error while reading the Main BCFG or TCFG data set."/>
              <param name="BCFG_NUM_WORDS" value="2" caption="Number of Boot configuration words to be read from Flash"/>
              <param name="TCFG_NUM_WORDS" value="2" caption="Number of Test configuration words to be read from Flash"/>
              <param name="RR_NUM_WORDS" value="1" caption="Number of Flash reads to load Redundancy Record wordsfrom Flash. Does not include Flash IP CFG.Note: This value must always be greater than or equal 1"/>
              <param name="SIGN_BIT_LOCATION" value="127" caption="The signature value is stored in it own flash word at SIGN_ADDR[] location. This is to support flash panels with ECC or restrictions on multi-programming per word/bit. The sign bit position must be set to PFM_DATA_MSB."/>
              <param name="CP_BIT_LOCATION" value="124" caption="The Code Protect value is stored in it own flash word at CP_ADDR[] location. This is to support flash panels with ECC or restrictions on multi-programming per word/bit.The sign bit position must be set to PFM_DATA_MSB-3."/>
              <param name="JTAGEN_BIT_LOCATION" value="98" caption="Location of the sign bit in the boot config word. This bit must never be programmed to 0 during a checkerboard program. PFM_DATA_MSB-29Config words are 128-bit regardless of the flash word size."/>
              <param name="PFM_NUM_PANELS" value="1" caption="Number of Flash panels supported in deviceValid entries are 1 or 2."/>
              <param name="PFM_ECC_PRESENT" value="1" caption="0: ECC not supported  ,    1: ECC supported"/>
              <param name="PFM_DATA_MSB" value="127" caption="Flash wrapper read data bus width-1"/>
              <param name="PFM_PNL_DATA_MSB" value="139" caption="Flash panel read data bus width-1"/>
              <param name="PFM_PNL_ADDR_MSB" value="21" caption="Flash panel read address bus width-1 (Unused)"/>
              <param name="ROW_ADDR_MSB" value="9" caption="Flash row word counter MSB  (9=256 words per row)"/>
              <param name="PAGE_ADDR_MSB" value="11" caption="Flash Page Size MSB (using byte addressing)   (11=4KB page)"/>
              <param name="NVR_NUM_PAGES" value="8" caption="Number of Pages in the NVR regionThe following values must be supported:8, 24"/>
              <param name="NVR_TEST_PAGES" value="1" caption="Number of Pages in the Panel 1 NVR for Test."/>
              <param name="PFM_JTAG_MSB" value="34" caption="JTAG checkerboard pattern data width-1The following values must be supported:34 for 128-bit data + ECC panels"/>
              <param name="VALIDS_PER_WORD" value="1" caption="Number of 128-bit writes to CFG per configuration reads fromflash. If the CFG block does not implement all CFG registersas defined then those VALIDS should not be connected.Note: This value must always be either 1 or 2."/>
              <param name="RR_NUM_RECORDS" value="2" caption="Number of Redundancy Records per Panel. Redundancy Records are 16-bit values. Panels usually have 1 Redundant Page per 512KB.Note: Valid values are 1,2,4,8,16,32."/>
              <param name="PFM_ERASE_RETRY_PRESENT" value="1" caption="0: Erase/Retry Feature not Present1: Erase/Retry Feature Present"/>
              <param name="PFM_SRHT_PRESENT" value="0" caption="Slow Read High Temp0: SRHT Feature not Present1: SRHT Feature Present"/>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGES" value="128"/>
              <param name="PAGES_PR_REGION" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="04701" name2="sec_pac_u2120_v3" version="A">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
              <param name="CHIP_PAC_PADDR_MSB" value="9"/>
              <param name="CHIP_PAC_HMATRIX1_IMPLEMENTED" value="0"/>
              <param name="CHIP_PAC_HPB_NUM" value="3"/>
              <param name="CHIP_PAC_HMATRIX0_SLAVE_SIZE" value="13"/>
              <param name="CHIP_PAC_HMATRIX1_SLAVE_SIZE" value="0"/>
            </parameters>
          </instance>
        </module>
