Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="DMAC_ID_OVF" value="39"/>
              <param name="DMAC_ID_MC0" value="40"/>
              <param name="DMAC_ID_MC1" value="41"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="27"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x40002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
              <param name="DMAC_ID_OVF" value="42"/>
              <param name="DMAC_ID_MC0" value="43"/>
              <param name="DMAC_ID_MC1" value="44"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="27"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="DMAC_ID_OVF" value="45"/>
              <param name="DMAC_ID_MC0" value="46"/>
              <param name="DMAC_ID_MC1" value="47"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="28"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x40003000"/>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
              <param name="DMAC_ID_OVF" value="48"/>
              <param name="DMAC_ID_MC0" value="49"/>
              <param name="DMAC_ID_MC1" value="50"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="28"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="04706" name2="tmr_tcc_u2213_v5" version="A">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x40003400"/>
            <parameters>
              <param name="INSTANCE_ID" value="13"/>
              <param name="SIZE" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="CC_NUM" value="6"/>
              <param name="OW_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="1"/>
              <param name="SWAP" value="1"/>
              <param name="PG" value="1"/>
              <param name="DMAC_ID_OVF" value="10"/>
              <param name="DMAC_ID_MC0" value="11"/>
              <param name="DMAC_ID_MC1" value="12"/>
              <param name="DMAC_ID_MC2" value="13"/>
              <param name="DMAC_ID_MC3" value="14"/>
              <param name="DMAC_ID_MC4" value="15"/>
              <param name="DMAC_ID_MC5" value="16"/>
              <param name="GCLK_ID" value="21"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x40003800"/>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
              <param name="SIZE" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="CC_NUM" value="6"/>
              <param name="OW_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="1"/>
              <param name="SWAP" value="1"/>
              <param name="PG" value="1"/>
              <param name="DMAC_ID_OVF" value="17"/>
              <param name="DMAC_ID_MC0" value="18"/>
              <param name="DMAC_ID_MC1" value="19"/>
              <param name="DMAC_ID_MC2" value="20"/>
              <param name="DMAC_ID_MC3" value="21"/>
              <param name="DMAC_ID_MC4" value="22"/>
              <param name="DMAC_ID_MC5" value="23"/>
              <param name="GCLK_ID" value="5"/>
            </parameters>
          </instance>
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x40003C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="15"/>
              <param name="SIZE" value="16"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="CC_NUM" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="1"/>
              <param name="SWAP" value="1"/>
              <param name="PG" value="1"/>
              <param name="DMAC_ID_OVF" value="24"/>
              <param name="DMAC_ID_MC0" value="25"/>
              <param name="DMAC_ID_MC1" value="26"/>
              <param name="GCLK_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="TPI" id="SYSTEM_IP" version="1.0.0">
          <instance name="TPI">
            <register-group name="TPI" name-in-module="TPI" address-space="base" offset="0xE0040000"/>
          </instance>
        </module>
        <module name="WDT" id="02674" name2="wdt_upb_v1" version="A">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x44000500"/>
            <parameters>
              <param name="UPB_ADDRL" value="320" caption="See Table 3-20"/>
              <param name="MAX_RUN_PS" value="20"/>
              <param name="MAX_SLEEP_PS" value="20"/>
              <param name="WINDOW_WDT" value="1" caption="enabled"/>
            </parameters>
          </instance>
        </module>
        <module name="ZIGBEE" id="04998" name2="zb_mac_v3" version="A">
          <instance name="ZIGBEE">
            <register-group name="ZIGBEE" name-in-module="ZIGBEE" address-space="base" offset="0x41010000"/>
