Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="MemoryManagement" index="-12" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt name="BusFault" index="-11" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt name="UsageFault" index="-10" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="DebugMonitor" index="-4" caption="Debug Monitor"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="RTC" index="0" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="1" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="2" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="NVM" index="3" module-instance="NVM" caption="Non-Volatile Memory"/>
        <interrupt name="CHANGE_NOTICE_A" index="4" module-instance="GPIOA" caption="PORT_A_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="CHANGE_NOTICE_B" index="5" module-instance="GPIOB" caption="PORT_B_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="DMAC_0_3" index="6" module-instance="DMAC" caption="DMA Channel 0..3"/>
        <interrupt name="DMAC_4_15" index="7" module-instance="DMAC" caption="DMA Channel 4..15"/>
        <interrupt name="EVSYS_0_3" index="8" module-instance="EVSYS" caption="Event System Channel 0..3"/>
        <interrupt name="EVSYS_4_11" index="9" module-instance="EVSYS" caption="Event System Channel 4..11"/>
        <interrupt name="PAC" index="10" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="RAMECC" index="11" module-instance="RAMECC" caption="RAM Error Correction Code"/>
        <interrupt name="SERCOM0" index="12" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="13" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="TCC0" index="14" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="15" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="16" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC0" index="17" module-instance="TC0" caption="Timer/Counter 0"/>
        <interrupt name="TC1" index="18" module-instance="TC1" caption="Timer/Counter 1"/>
        <interrupt name="TC2" index="19" module-instance="TC2" caption="Timer/Counter 2"/>
        <interrupt name="TC3" index="20" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="21" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="TC5" index="22" module-instance="TC5" caption="Timer/Counter 5"/>
        <interrupt name="TC6" index="23" module-instance="TC6" caption="Timer/Counter 6"/>
        <interrupt name="TC7" index="24" module-instance="TC7" caption="Timer/Counter 7"/>
        <interrupt name="ADCHS_IRQ" index="25" module-instance="ADCHS" caption="Analog-to-Digital Converter"/>
        <interrupt name="AC" index="26" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="SILEX_0" index="27" module-instance="SILEX" caption="Crypto 0"/>
        <interrupt name="SILEX_1" index="28" module-instance="SILEX" caption="Crypto 1"/>
        <interrupt name="QSPI" index="29" module-instance="QSPI" caption="Quad SPI interface"/>
        <interrupt name="ZB_INT0" index="30" module-instance="ZIGBEE" caption="ZIGBEE"/>
        <interrupt name="BT_INT0" index="31" module-instance="BLE" caption="Bluetooth 0"/>
        <interrupt name="BT_INT1" index="32" module-instance="BLE" caption="Bluetooth 1"/>
        <interrupt name="ARBITER" index="33" module-instance="ARB" caption="Radio Arbiter"/>
        <interrupt name="ADCHS_FAULT" index="34" module-instance="ADCHS" caption="ADC Fault Interrupt"/>
        <interrupt name="ADCHS_FCC" index="35" module-instance="ADCHS" caption="ADC FCC Interrupt"/>
        <interrupt name="ADCHS_BGVR_RDY" index="36" module-instance="ADCHS" caption="ADC BGVR Ready"/>
        <interrupt name="CLKI_WAKEUP_NMI" index="37" module-instance="BLE" caption="WSS WAKEUP"/>
        <interrupt name="CVD" index="38" module-instance="CVD" caption="CVD Interrpt"/>
        <interrupt name="DGI_SPI" index="39" module-instance="DGI_SPI" caption="DGI_SPI interrupt"/>
        <interrupt name="BT_LC" index="42" module-instance="BLE" caption="Bluetooth LC"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_PER_0" index="1" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="2" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="3" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="8" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="9" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="10" module-instance="RTC"/>
          <generator name="RTC_CMP_2" index="11" module-instance="RTC"/>
          <generator name="RTC_CMP_3" index="12" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="13" module-instance="RTC"/>
          <generator name="RTC_OVF" index="14" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="18" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="19" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="20" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="21" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="22" module-instance="DMAC"/>
          <generator name="PAC_ACCERR" index="23" module-instance="PAC"/>
          <generator name="TCC0_OVF" index="24" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="25" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="26" module-instance="TCC0"/>
          <generator name="TCC0_MCX_0" index="27" module-instance="TCC0"/>
          <generator name="TCC0_MCX_1" index="28" module-instance="TCC0"/>
          <generator name="TCC0_MCX_2" index="29" module-instance="TCC0"/>
          <generator name="TCC0_MCX_3" index="30" module-instance="TCC0"/>
          <generator name="TCC0_MCX_4" index="31" module-instance="TCC0"/>
          <generator name="TCC0_MCX_5" index="32" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="33" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="34" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="35" module-instance="TCC1"/>
          <generator name="TCC1_MCX_0" index="36" module-instance="TCC1"/>
          <generator name="TCC1_MCX_1" index="37" module-instance="TCC1"/>
          <generator name="TCC1_MCX_2" index="38" module-instance="TCC1"/>
          <generator name="TCC1_MCX_3" index="39" module-instance="TCC1"/>
          <generator name="TCC1_MCX_4" index="40" module-instance="TCC1"/>
          <generator name="TCC1_MCX_5" index="41" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="42" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="43" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="44" module-instance="TCC2"/>
          <generator name="TCC2_MCX_0" index="45" module-instance="TCC2"/>
          <generator name="TCC2_MCX_1" index="46" module-instance="TCC2"/>
          <generator name="TC0_OVF" index="47" module-instance="TC0"/>
          <generator name="TC0_MCX_0" index="48" module-instance="TC0"/>
          <generator name="TC0_MCX_1" index="49" module-instance="TC0"/>
          <generator name="TC1_OVF" index="50" module-instance="TC1"/>
          <generator name="TC1_MCX_0" index="51" module-instance="TC1"/>
          <generator name="TC1_MCX_1" index="52" module-instance="TC1"/>
          <generator name="TC2_OVF" index="53" module-instance="TC2"/>
          <generator name="TC2_MCX_0" index="54" module-instance="TC2"/>
          <generator name="TC2_MCX_1" index="55" module-instance="TC2"/>
          <generator name="TC3_OVF" index="56" module-instance="TC3"/>
          <generator name="TC3_MCX_0" index="57" module-instance="TC3"/>
          <generator name="TC3_MCX_1" index="58" module-instance="TC3"/>
          <generator name="TC4_OVF" index="59" module-instance="TC4"/>
          <generator name="TC4_MCX_0" index="60" module-instance="TC4"/>
          <generator name="TC4_MCX_1" index="61" module-instance="TC4"/>
          <generator name="TC5_OVF" index="62" module-instance="TC5"/>
          <generator name="TC5_MCX_0" index="63" module-instance="TC5"/>
          <generator name="TC5_MCX_1" index="64" module-instance="TC5"/>
          <generator name="TC6_OVF" index="65" module-instance="TC6"/>
          <generator name="TC6_MCX_0" index="66" module-instance="TC6"/>
          <generator name="TC6_MCX_1" index="67" module-instance="TC6"/>
          <generator name="TC7_OVF" index="68" module-instance="TC7"/>
          <generator name="TC7_MCX_0" index="69" module-instance="TC7"/>
          <generator name="TC7_MCX_1" index="70" module-instance="TC7"/>
          <generator name="ADCHS_EVENT_0" index="71" module-instance="ADCHS"/>
          <generator name="ADCHS_EVENT_1" index="72" module-instance="ADCHS"/>
          <generator name="ADCHS_EVENT_2" index="73" module-instance="ADCHS"/>
          <generator name="AC_COMP_0" index="74" module-instance="AC"/>
          <generator name="AC_COMP_1" index="75" module-instance="AC"/>
          <generator name="AC_WIN" index="76" module-instance="AC"/>
          <generator name="CCL_LUTOUT_0" index="77" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="78" module-instance="CCL"/>
          <generator name="ZIGBEE_TX_TS_ACTIVE" index="79" module-instance="ZIGBEE"/>
          <generator name="ZIGBEE_RX_TS_ACTIVE" index="80" module-instance="ZIGBEE"/>
        </generators>
        <users>
          <user name="RTC_TAMPER" index="0" module-instance="RTC"/>
          <user name="DMAC_CH_0" index="1" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="2" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="3" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="4" module-instance="DMAC"/>
          <user name="DMAC_CH_4" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_5" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_6" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_7" index="8" module-instance="DMAC"/>
          <user name="CM4_TRACE_START" index="9" module-instance="CM4"/>
          <user name="CM4_TRACE_STOP" index="10" module-instance="CM4"/>
          <user name="CM4_TRACE_TRIG" index="11" module-instance="CM4"/>
          <user name="TCC0_EV_0" index="12" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="14" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="15" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="16" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="17" module-instance="TCC0"/>
          <user name="TCC0_MC_4" index="18" module-instance="TCC0"/>
          <user name="TCC0_MC_5" index="19" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="20" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="21" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="22" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="23" module-instance="TCC1"/>
          <user name="TCC1_MC_2" index="24" module-instance="TCC1"/>
          <user name="TCC1_MC_3" index="25" module-instance="TCC1"/>
          <user name="TCC1_MC_4" index="26" module-instance="TCC1"/>
          <user name="TCC1_MC_5" index="27" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="28" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="29" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="30" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="31" module-instance="TCC2"/>
          <user name="TC0_EVU" index="32" module-instance="TC0"/>
          <user name="TC1_EVU" index="33" module-instance="TC1"/>
          <user name="TC2_EVU" index="34" module-instance="TC2"/>
          <user name="TC3_EVU" index="35" module-instance="TC3"/>
          <user name="TC4_EVU" index="36" module-instance="TC4"/>
          <user name="TC5_EVU" index="37" module-instance="TC5"/>
          <user name="TC6_EVU" index="38" module-instance="TC6"/>
          <user name="TC7_EVU" index="39" module-instance="TC7"/>
          <user name="ADCHS_TRIG_0" index="40" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_1" index="41" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_2" index="42" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_3" index="43" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_4" index="44" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_5" index="45" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_6" index="46" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_7" index="47" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_8" index="48" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_9" index="49" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_10" index="50" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_11" index="51" module-instance="ADCHS"/>
          <user name="AC_SOC_0" index="52" module-instance="AC"/>
          <user name="AC_SOC_1" index="53" module-instance="AC"/>
          <user name="CCL_LUTIN_0" index="54" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="55" module-instance="CCL"/>
          <user name="CVD_TRIGGER" index="56" module-instance="CVD"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x00009E02"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="CVD" id="05033" name2="adc_cvd_ctrl_upb_v2" version="Rev A.1" caption="Hardware CVD Controller Macro">
      <register-group name="CVD" caption="Hardware CVD Controller Macro">
        <register name="CVDCON" offset="0x0" rw="RW" size="4" initval="0x00020000" caption="CVD Control Register">
          <bitfield name="TRIGSEL" caption="Selects one of 15 external trigger inputs to start scanning." mask="0xF"/>
          <bitfield name="CLKSEL" caption="Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3" mask="0x30"/>
          <bitfield name="FIFOTH" caption="Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion" mask="0x3FF00"/>
          <bitfield name="FIFOTHIEN" caption="FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met" mask="0x40000"/>
          <bitfield name="CVDIEN" caption="Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts." mask="0x80000"/>
          <bitfield name="THSTR" caption="Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO" mask="0x800000"/>
          <bitfield name="SWTRIG" caption="Software Trigger control. Starts scan manuallyCleared by Hardware." mask="0x1000000"/>
          <bitfield name="ABORT" caption="Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware" mask="0x2000000"/>
          <bitfield name="SDWREN" caption="Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain." mask="0x8000000"/>
          <bitfield name="ORDER" caption="RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue" mask="0x10000000"/>
          <bitfield name="SIDL" caption="Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode" mask="0x20000000"/>
          <bitfield name="FRZ" caption="Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode" mask="0x40000000"/>
          <bitfield name="ON" caption="Enables the State Machine to scan enabled Scan Descriptors upon next trigger." mask="0x80000000"/>
        </register>
