Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="AMOD" caption="Access Mode" mask="0x3"/>
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x10" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x18" rw="R" size="4" initval="0x00009E02" caption="Device Identification">
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
          <bitfield name="DIE" caption="Die Number" mask="0xFF00"/>
          <bitfield name="SERIES" caption="Series" mask="0x3F0000"/>
          <bitfield name="FAMILY" caption="Family" mask="0xF800000"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0000000"/>
        </register>
        <register name="CFG" offset="0x1C" rw="RW" size="4" initval="0x00000002" caption="Configuration">
          <bitfield name="LQOS" caption="Latency Quality Of Service" mask="0x3"/>
          <bitfield name="DCCDMALEVEL" caption="DMA Trigger Level" mask="0xC" values="DSU_CFG__DCCDMALEVEL"/>
          <bitfield name="ETBRAMEN" caption="Trace Control" mask="0x10"/>
        </register>
        <register name="UUID" offset="0x38" rw="R" size="4" count="4" initval="0x00000000" caption="Unique Identifier n">
          <bitfield name="UUID" caption="UUID" mask="0xFFFFFFFF"/>
        </register>
        <register name="SECCFG" offset="0x48" rw="R" size="4" initval="0x00000000" caption="Secure Config">
          <bitfield name="SECCFG" caption="Secure Config" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTR_STAT" offset="0x4C" rw="R" size="4" initval="0x00000000" caption="RoT Rollback counter">
          <bitfield name="ROLLBACK_CTR" caption="Rollback counter" mask="0xFF"/>
        </register>
        <register name="BOOT_STAT" offset="0x50" rw="R" size="4" initval="0x00000000" caption="RoT Boot Status">
          <bitfield name="BOOT_STATUS" caption="Boot Status" mask="0xFF"/>
        </register>
        <register name="BOOT_KEY" offset="0x54" rw="R" size="4" count="12" initval="0x00000000" caption="Secure Boot Key n">
          <bitfield name="BOOT_KEY" caption="Secure Boot Key" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCFG" offset="0xF0" rw="RW" size="4" count="2" initval="0x00000000" caption="Device Configuration">
          <bitfield name="DCFG" caption="Device Configuration" mask="0xFFFFFFFF"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9F0FC002" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 1">
			</register>
        <register name="END" offset="0x1008" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table End">
          <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x0000000A" caption="Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DSU_CFG__DCCDMALEVEL">
        <value name="EMPTY" caption="Trigger rises when DCC is empty" value="0"/>
        <value name="FULL" caption="Trigger rises when DCC is full" value="1"/>
      </value-group>
    </module>
    <module name="DWT" id="SYSTEM_IP" version="1.0.0" caption="Data Watchpoint and Trace Register">
      <register-group name="DWT" caption="Data Watchpoint and Trace Register">
        <register name="CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Control Register">
          <bitfield name="CYCCNTENA" caption="" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="" mask="0x400000"/>
          <bitfield name="NOPRFCNT" caption="" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="" mask="0xF0000000"/>
        </register>
        <register name="CYCCNT" offset="0x4" rw="RW" size="4" access-size="4" caption="Cycle Count Register">
        </register>
        <register name="CPICNT" offset="0x8" rw="RW" size="4" access-size="4" caption="CPI Count Register">
          <bitfield name="CPICNT" caption="" mask="0xFF"/>
        </register>
        <register name="EXCCNT" offset="0xC" rw="RW" size="4" access-size="4" caption="Exception Overhead Count Register">
          <bitfield name="EXCCNT" caption="" mask="0xFF"/>
        </register>
        <register name="SLEEPCNT" offset="0x10" rw="RW" size="4" access-size="4" caption="Sleep Count Register">
          <bitfield name="SLEEPCNT" caption="" mask="0xFF"/>
        </register>
        <register name="LSUCNT" offset="0x14" rw="RW" size="4" access-size="4" caption="LSU Count Register">
          <bitfield name="LSUCNT" caption="" mask="0xFF"/>
        </register>
        <register name="FOLDCNT" offset="0x18" rw="RW" size="4" access-size="4" caption="Folded-instruction Count Register">
          <bitfield name="FOLDCNT" caption="" mask="0xFF"/>
        </register>
        <register name="PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="Program Counter Sample Register">
        </register>
        <register name="COMP0" offset="0x20" rw="RW" size="4" access-size="4" caption="Comparator Register 0">
        </register>
        <register name="MASK0" offset="0x24" rw="RW" size="4" access-size="4" caption="Mask Register 0">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION0" offset="0x28" rw="RW" size="4" access-size="4" caption="Function Register 0">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP1" offset="0x30" rw="RW" size="4" access-size="4" caption="Comparator Register 1">
        </register>
        <register name="MASK1" offset="0x34" rw="RW" size="4" access-size="4" caption="Mask Register 1">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION1" offset="0x38" rw="RW" size="4" access-size="4" caption="Function Register 1">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP2" offset="0x40" rw="RW" size="4" access-size="4" caption="Comparator Register 2">
        </register>
