Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="RNG_CONTROL_FIFOTHRESHOLD" offset="0x1008" rw="RW" size="4" initval="0x00000000" caption="FIFO threshold register.">
          <bitfield name="FIFOTHRESHOLD" caption="FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_FIFODEPTH" offset="0x100C" rw="R" size="4" initval="0x00000000" caption="FIFO depth register.">
          <bitfield name="FIFODEPTH" caption="Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_KEY0" offset="0x1010" rw="RW" size="4" initval="0x00000000" caption="Key register (MSB).">
          <bitfield name="KEY0" caption="Key register (MSB)." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_KEY1" offset="0x1014" rw="RW" size="4" initval="0x00000000" caption="Key register.">
          <bitfield name="KEY1" caption="Key register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_KEY2" offset="0x1018" rw="RW" size="4" initval="0x00000000" caption="Key register.">
          <bitfield name="KEY2" caption="Key register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_KEY3" offset="0x101C" rw="RW" size="4" initval="0x00000000" caption="Key register (LSB).">
          <bitfield name="KEY3" caption="Key register (LSB)." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_TESTDATA" offset="0x1020" rw="W" size="4" initval="0x00000000" caption="Test data register.">
          <bitfield name="TESTDATA" caption="Test data register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_REPEATTHRESHOLD" offset="0x1024" rw="RW" size="4" initval="0x00000000" caption="Repetition Test Count Cut-Off value.">
          <bitfield name="REPEATTHRESHOLD" caption="Repetition Test Count Cut-Off value." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_PROPTHRESHOLD" offset="0x1028" rw="RW" size="4" initval="0x00000000" caption="Adaptive Proportion Test (1024-sample window) Cut-Off value.">
          <bitfield name="PROPTHRESHOLD" caption="Adaptive Proportion Test (1024-sample window) Cut-Off value." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_STATUS" offset="0x1030" rw="RW" size="4" initval="0x00000000" caption="Status register.">
          <bitfield name="TESTDATABUSY" caption="High when data written to TestData register is being processed. (see section 4.7)" mask="0x1"/>
          <bitfield name="STATE" caption="State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused." mask="0xE"/>
          <bitfield name="REPFAIL" caption="NIST-800-90B repetition Count Test interrupt status." mask="0x10"/>
          <bitfield name="PROPFAIL" caption="NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status." mask="0x20"/>
          <bitfield name="FULLINT" caption="FIFO full status." mask="0x80"/>
          <bitfield name="PREINT" caption="AIS31 preliminary noise alarm interrupt status." mask="0x100"/>
          <bitfield name="ALMINT" caption="AIS31 noise alarm interrupt status." mask="0x200"/>
          <bitfield name="STARTUPFAIL" caption="Start-up test failure." mask="0x400"/>
          <bitfield name="FIFOACCFAIL" caption="Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0)." mask="0x800"/>
        </register>
        <register name="RNG_CONTROL_INITWAITVAL" offset="0x1034" rw="RW" size="4" initval="0x0000FFFF" caption="Initial wait counter value.">
          <bitfield name="INITWAITVAL" caption="Number of clock cycles to wait before sampling data from the noise source." mask="0xFFFF"/>
        </register>
        <register name="RNG_CONTROL_DISABLEOSC0" offset="0x1038" rw="RW" size="4" initval="0x00000000" caption="Disable oscillator rings #0 to #31.">
          <bitfield name="DISABLEOSC0" caption="Disable oscillator rings #0 to #31." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_DISABLEOSC1" offset="0x103C" rw="RW" size="4" initval="0x00000000" caption="Disable oscillator rings #32 to #63.">
          <bitfield name="DISABLEOSC1" caption="Disable oscillator rings #32 to #63." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_CONTROL_SWOFFTMRVAL" offset="0x1040" rw="RW" size="4" initval="0x00000000" caption="Switch off timer value.">
          <bitfield name="SWOFFTMRVAL" caption="Number of clk cycles to wait before stopping the rings after the FIFO is full." mask="0xFFFF"/>
        </register>
        <register name="RNG_CONTROL_CLKDIV" offset="0x1044" rw="RW" size="4" initval="0x00000000" caption="Sample clock divider.">
          <bitfield name="CLKDIV" caption="Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1)." mask="0xFF"/>
        </register>
        <register name="RNG_CONTROL_AIS31CONF0" offset="0x1048" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 0.">
          <bitfield name="STARTUPTHRESHOLD" caption="Start-up test threshold." mask="0xFFFF"/>
          <bitfield name="ONLINETHRESHOLD" caption="Online threshold." mask="0xFFFF0000"/>
        </register>
        <register name="RNG_CONTROL_AIS31CONF1" offset="0x104C" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 1.">
          <bitfield name="ONLINEREPTHRESHOLD" caption="Online repeat threshold." mask="0xFFFF"/>
          <bitfield name="HEXPECTEDVALUE" caption="Expected history value." mask="0xFFFF0000"/>
        </register>
        <register name="RNG_CONTROL_AIS31CONF2" offset="0x1050" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 2.">
          <bitfield name="HMIN" caption="Minimum allowed history value." mask="0xFFFF"/>
          <bitfield name="HMAX" caption="Maximum allowed history value." mask="0xFFFF0000"/>
        </register>
        <register name="RNG_CONTROL_AIS31STATUS" offset="0x1054" rw="RW" size="4" initval="0x00000000" caption="AIS31 status register.">
          <bitfield name="NUMPRELIMALARMS" caption="Number of preliminary noise alarms since counter was last cleared." mask="0xFFFF"/>
          <bitfield name="PRELIMNOISEALARMRNG" caption="Last preliminary noise alarm occurred due to history value out of range." mask="0x10000"/>
          <bitfield name="PRELIMNOISEALARMREP" caption="Last preliminary noise alarm occurred due to consecutive high X**2." mask="0x20000"/>
        </register>
        <register name="RNG_CONTROL_HWCONFIG" offset="0x1058" rw="R" size="4" initval="0x00000000" caption="Hardware configuration register.">
          <bitfield name="NUMBOFRINGS" caption="Generic g_NumRings value." mask="0xFF"/>
          <bitfield name="AIS31" caption="Generic g_AIS31 value." mask="0x100"/>
          <bitfield name="AIS31Full" caption="Generic g_AIS31Full value." mask="0x200"/>
        </register>
