Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
    <module name="AC" id="U2501" version="1.0.0" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x7" rw="R" size="1" initval="0x00" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30" values="AC_STATUSA__WSTATE0"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x9" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="WINCTRL" offset="0xA" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Window Control">
          <bitfield name="WEN0" caption="Window 0 Mode Enable" mask="0x1"/>
          <bitfield name="WINTSEL0" caption="Window 0 Interrupt Selection" mask="0x6" values="AC_WINCTRL__WINTSEL0"/>
        </register>
        <register name="SCALER" offset="0xC" rw="RW" size="1" count="2" initval="0x00" caption="Scaler n">
          <bitfield name="VALUE" caption="Scaler Value" mask="0x3F"/>
        </register>
