Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="ADCCMP0SET" offset="0xf8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCMP0INV" offset="0xfc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCMPEN1CLR" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCMPEN1SET" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCMPEN1INV" offset="0x10c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADDCMP1CLR" offset="0x114" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADDCMP1SET" offset="0x118" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADDCMP1INV" offset="0x11c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCFLTR0CLR" offset="0x1a4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCFLTR0SET" offset="0x1a8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCFLTR0INV" offset="0x1ac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCFLTR1CLR" offset="0x1b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCFLTR1SET" offset="0x1b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCFLTR1INV" offset="0x1bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCTRG1CLR" offset="0x204" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCTRG1SET" offset="0x208" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCTRG1INV" offset="0x20c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADTRG2CLR" offset="0x214" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADTRG2SET" offset="0x218" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADTRG2INV" offset="0x21c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADTRG3CLR" offset="0x224" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADTRG3SET" offset="0x228" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADTRG3INV" offset="0x22c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCMPCON1CLR" offset="0x284" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCMPCON1SET" offset="0x288" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCMPCON1INV" offset="0x28c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCMPCON2CLR" offset="0x294" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCMPCON2SET" offset="0x298" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCMPCON2INV" offset="0x29c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCFSTATCLR" offset="0x2e4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCFSTATSET" offset="0x2e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCFSTATINV" offset="0x2ec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCFIFOCLR" offset="0x2f4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCFIFOSET" offset="0x2f8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCFIFOINV" offset="0x2fc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCBASECLR" offset="0x304" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCBASESET" offset="0x308" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCBASEINV" offset="0x30c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCDMASTATCLR" offset="0x314" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCDMASTATSET" offset="0x318" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCDMASTATINV" offset="0x31c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCNTBCLR" offset="0x324" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCNTBSET" offset="0x328" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCNTBINV" offset="0x32c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCDMABCLR" offset="0x334" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCDMABSET" offset="0x338" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCDMABINV" offset="0x33c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCTRGSNSCLR" offset="0x344" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCTRGSNSSET" offset="0x348" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCTRGSNSINV" offset="0x34c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADC0TIMECLR" offset="0x354" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
