Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN11">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
    </module>
    <module caption="BLE" version="1.0" id="04999" name="BLE">
      <register-group caption="BLE" name="BLE">
        <!-- Turned bit fields into registers for Chris here -->
        <register name="DPLL_RG1" offset="0x04B8" rw="RW" size="2" caption="">
          <bitfield name="DPLL_RG1BITS" mask="0xFFFF" caption=""/>
        </register>
        <register name="DPLL_RG2" offset="0x04BA" rw="RW" size="2" caption="">
          <bitfield name="DPLL_RG2BITS" mask="0xFFFF" caption=""/>
        </register>
      </register-group>
    </module>
    <module name="CCL" id="U2225" version="1.1.0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="1" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="2" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
        <value name="ALT2TC" caption="Alternate2 TC input source" value="10"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source" value="11"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="DISABLE" caption="Incoming event is not inverted" value="0"/>
        <value name="ENABLE" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
