Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="ODCSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="ODCINV" offset="0x4C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPU" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNPU3" caption="" mask="0x8"/>
          <bitfield name="CNPU4" caption="" mask="0x10"/>
          <bitfield name="CNPU5" caption="" mask="0x20"/>
          <bitfield name="CNPU6" caption="" mask="0x40"/>
          <bitfield name="CNPU7" caption="" mask="0x80"/>
          <bitfield name="CNPU8" caption="" mask="0x100"/>
          <bitfield name="CNPU9" caption="" mask="0x200"/>
          <bitfield name="CNPU10" caption="" mask="0x400"/>
        </register>
        <register name="CNPUCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPUSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPUINV" offset="0x5C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPD" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNPD3" caption="" mask="0x8"/>
          <bitfield name="CNPD4" caption="" mask="0x10"/>
          <bitfield name="CNPD5" caption="" mask="0x20"/>
          <bitfield name="CNPD6" caption="" mask="0x40"/>
          <bitfield name="CNPD7" caption="" mask="0x80"/>
          <bitfield name="CNPD8" caption="" mask="0x100"/>
          <bitfield name="CNPD9" caption="" mask="0x200"/>
          <bitfield name="CNPD10" caption="" mask="0x400"/>
        </register>
        <register name="CNPDCLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPDSET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPDINV" offset="0x6C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCON" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EDGEDETECT" caption="" mask="0x800"/>
          <bitfield name="SIDL" caption="" mask="0x2000"/>
          <bitfield name="FRZ" caption="" mask="0x4000"/>
          <bitfield name="ON" caption="" mask="0x8000"/>
        </register>
        <register name="CNCONCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCONSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCONINV" offset="0x7C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNEN" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNIE3" caption="" mask="0x8"/>
          <bitfield name="CNIE4" caption="" mask="0x10"/>
          <bitfield name="CNIE5" caption="" mask="0x20"/>
          <bitfield name="CNIE6" caption="" mask="0x40"/>
          <bitfield name="CNIE7" caption="" mask="0x80"/>
          <bitfield name="CNIE8" caption="" mask="0x100"/>
          <bitfield name="CNIE9" caption="" mask="0x200"/>
          <bitfield name="CNIE10" caption="" mask="0x400"/>
        </register>
        <register name="CNENCLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNENSET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNENINV" offset="0x8C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTAT" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNSTAT3" caption="" mask="0x8"/>
          <bitfield name="CNSTAT4" caption="" mask="0x10"/>
          <bitfield name="CNSTAT5" caption="" mask="0x20"/>
          <bitfield name="CNSTAT6" caption="" mask="0x40"/>
          <bitfield name="CNSTAT7" caption="" mask="0x80"/>
          <bitfield name="CNSTAT8" caption="" mask="0x100"/>
          <bitfield name="CNSTATA" caption="" mask="0x200"/>
          <bitfield name="CNSTAT10" caption="" mask="0x400"/>
        </register>
        <register name="CNSTATCLR" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTATSET" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTATINV" offset="0x9C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNE" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNNE3" caption="" mask="0x8"/>
          <bitfield name="CNNE4" caption="" mask="0x10"/>
          <bitfield name="CNNE5" caption="" mask="0x20"/>
          <bitfield name="CNNE6" caption="" mask="0x40"/>
          <bitfield name="CNNE7" caption="" mask="0x80"/>
          <bitfield name="CNNE8" caption="" mask="0x100"/>
          <bitfield name="CNNE9" caption="" mask="0x200"/>
          <bitfield name="CNNE10" caption="" mask="0x400"/>
        </register>
        <register name="CNNECLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNESET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNEINV" offset="0xaC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNF" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNF3" caption="" mask="0x8"/>
          <bitfield name="CNF4" caption="" mask="0x10"/>
          <bitfield name="CNF5" caption="" mask="0x20"/>
          <bitfield name="CNF6" caption="" mask="0x40"/>
          <bitfield name="CNF7" caption="" mask="0x80"/>
          <bitfield name="CNF8" caption="" mask="0x100"/>
          <bitfield name="CNF9" caption="" mask="0x200"/>
          <bitfield name="CNF10" caption="" mask="0x400"/>
        </register>
        <register name="CNFCLR" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNFSET" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
