Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="CNFINV" offset="0xbC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SR03" caption="" mask="0x8"/>
          <bitfield name="SR04" caption="" mask="0x10"/>
          <bitfield name="SR05" caption="" mask="0x20"/>
          <bitfield name="SR06" caption="" mask="0x40"/>
          <bitfield name="SR07" caption="" mask="0x80"/>
          <bitfield name="SR08" caption="" mask="0x100"/>
          <bitfield name="SR09" caption="" mask="0x200"/>
          <bitfield name="SR010" caption="" mask="0x400"/>
        </register>
        <register name="SRCON0CLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0SET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0INV" offset="0xcC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SR13" caption="" mask="0x8"/>
          <bitfield name="SR14" caption="" mask="0x10"/>
          <bitfield name="SR15" caption="" mask="0x20"/>
          <bitfield name="SR16" caption="" mask="0x40"/>
          <bitfield name="SR17" caption="" mask="0x80"/>
          <bitfield name="SR18" caption="" mask="0x100"/>
          <bitfield name="SR19" caption="" mask="0x200"/>
          <bitfield name="SR110" caption="" mask="0x400"/>
        </register>
        <register name="SRCON1CLR" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1SET" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1INV" offset="0xdC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
      </register-group>
    </module>
    <module name="HMATRIX2TOP" id="04585" version="6.0.0" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
        </register>
      </register-group>
      <register-group name="HMATRIX2TOP" caption="HSB Matrix">
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="16"/>
      </register-group>
    </module>
    <module name="PAC" id="U2120" version="3.0.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="SRAM0_" caption="SRAM0" mask="0x1"/>
          <bitfield name="SRAM1_" caption="SRAM1" mask="0x2"/>
          <bitfield name="SRAM2_" caption="SRAM2" mask="0x4"/>
          <bitfield name="SRAM3_" caption="SRAM3" mask="0x8"/>
          <bitfield name="CFLASH_" caption="CFLASH" mask="0x10"/>
          <bitfield name="PFLASH_" caption="PFLASH" mask="0x20"/>
          <bitfield name="HPBA_" caption="HPBA" mask="0x40"/>
          <bitfield name="HPBB_" caption="HPBB" mask="0x80"/>
          <bitfield name="HPBC_" caption="HPBC" mask="0x100"/>
          <bitfield name="HPBPIC_" caption="HPBPIC0" mask="0x200"/>
          <bitfield name="QSPI_" caption="QSPI" mask="0x400"/>
          <bitfield name="ROT_" caption="ROT" mask="0x800"/>
          <bitfield name="CRYPTO_" caption="CRYPTO" mask="0x1000"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x2"/>
          <bitfield name="EIC_" caption="EIC" mask="0x4"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x8"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x10"/>
          <bitfield name="TC0_" caption="TC0" mask="0x20"/>
          <bitfield name="TC1_" caption="TC1" mask="0x40"/>
          <bitfield name="TC2_" caption="TC2" mask="0x80"/>
          <bitfield name="TC3_" caption="TC3" mask="0x100"/>
          <bitfield name="TC4_" caption="TC4" mask="0x200"/>
          <bitfield name="TC5_" caption="TC5" mask="0x400"/>
          <bitfield name="TC6_" caption="TC6" mask="0x800"/>
          <bitfield name="TC7_" caption="TC7" mask="0x1000"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x2000"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x4000"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x8000"/>
        </register>
