Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="DSU_" caption="DSU" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x4"/>
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x8"/>
          <bitfield name="RAMECC_" caption="RAMECC" mask="0x10"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="QSPI_" caption="QSPI" mask="0x1"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x2"/>
          <bitfield name="CCL_" caption="CCL" mask="0x40"/>
          <bitfield name="AC_" caption="AC" mask="0x80"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00010000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x2"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x40"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x80"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x100"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x200"/>
          <bitfield name="TC5_" caption="TC5 APB Protect Enable" mask="0x400"/>
          <bitfield name="TC6_" caption="TC6 APB Protect Enable" mask="0x800"/>
          <bitfield name="TC7_" caption="TC7 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x8000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x4"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x8"/>
          <bitfield name="RAMECC_" caption="RAMECC APB Protect Enable" mask="0x10"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="QSPI_" caption="QSPI APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x2"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x40"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PCHE" id="03088" version="1.0" caption="this is the PCHE">
      <register-group name="PCHE" caption="this is the PCHE">
        <register name="CHECON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0700010F" caption="">
          <bitfield name="PFMWS" caption="" mask="0xf"/>
          <bitfield name="PREFEN" caption="" mask="0x30"/>
          <bitfield name="PFMSECEN" caption="" mask="0x80"/>
          <bitfield name="ADRWS" caption="" mask="0x100"/>
          <bitfield name="CHEPERF" caption="" mask="0x1000"/>
          <bitfield name="ICHECOH" caption="" mask="0x10000"/>
          <bitfield name="DCHECOH" caption="" mask="0x20000"/>
          <bitfield name="ACHECOH" caption="" mask="0x40000"/>
          <bitfield name="ICHEINV" caption="" mask="0x100000"/>
          <bitfield name="DCHEINV" caption="" mask="0x200000"/>
          <bitfield name="ACHEINV" caption="" mask="0x400000"/>
          <bitfield name="ICHEEN" caption="" mask="0x1000000"/>
          <bitfield name="DCHEEN" caption="" mask="0x2000000"/>
          <bitfield name="ACHEEN" caption="" mask="0x4000000"/>
        </register>
        <register name="CHECONCLR" offset="0x04" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHECONSET" offset="0x08" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHECONINV" offset="0x0C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHESTAT" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PFMSECCNT" caption="" mask="0xff"/>
          <bitfield name="PFMSEC" caption="" mask="0x4000000"/>
          <bitfield name="PFMDED" caption="" mask="0x8000000"/>
        </register>
        <register name="CHESTATCLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHESTATSET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHESTATINV" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEHIT" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CHEHIT" caption="" mask="0xffffffff"/>
        </register>
        <register name="CHEHITCLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEHITSET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
