Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
    <module name="PMU" id="04856" version="A" caption="PMU SPI controller">
      <register-group name="PMU" caption="PMU SPI controller">
        <register name="SPICTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SPIWDATA" caption="" mask="0xffff"/>
          <bitfield name="SPIADDR" caption="" mask="0xff0000"/>
          <bitfield name="CMD" caption="" mask="0x1000000"/>
          <bitfield name="PMUCRST" caption="" mask="0x40000000"/>
          <bitfield name="SPIRST" caption="" mask="0x80000000"/>
        </register>
        <register name="SPISTATUS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000008" caption="">
          <bitfield name="SPIERR" caption="" mask="0x1"/>
          <bitfield name="SPIRDY" caption="" mask="0x80"/>
          <bitfield name="SPIADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIRDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="CLKCTRL" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00005082" caption="">
          <bitfield name="SPICLKDIV" caption="" mask="0x3f"/>
          <bitfield name="PMUANA_BKBOREN" caption="" mask="0x40"/>
          <bitfield name="SPISRC" caption="" mask="0x80"/>
          <bitfield name="BUCKCLKDIV" caption="" mask="0x3f00"/>
          <bitfield name="BUCKSRC" caption="" mask="0xc000"/>
          <bitfield name="BACWD" caption="" mask="0x10000"/>
          <bitfield name="MLDOEXTEN" caption="" mask="0x20000"/>
          <bitfield name="MVREFFSMEN" caption="" mask="0x40000"/>
          <bitfield name="CMP_CYCLE" caption="" mask="0xf00000"/>
          <bitfield name="BKCLK_HW_OVR" caption="" mask="0x1000000"/>
          <bitfield name="MLDOEXT_BOREN" caption="" mask="0x4000000"/>
          <bitfield name="ADCBOREN" caption="" mask="0x8000000"/>
          <bitfield name="BUCKBOREN" caption="" mask="0x10000000"/>
          <bitfield name="F_BCLK_CFG" caption="" mask="0x20000000"/>
        </register>
        <register name="MODECTRL1" offset="0xc" rw="RW" size="4" access-size="4" initval="0x80000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="MODECTRL2" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="MODECTRL3" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="MODECTRL4" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="OVERCTRL" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x80400000" caption="">
          <bitfield name="VREG4OCTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3OCTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2OCTRL" caption="" mask="0x1f0000"/>
          <bitfield name="PHWC" caption="" mask="0x400000"/>
          <bitfield name="OVEREN" caption="" mask="0x800000"/>
          <bitfield name="VREG1OCTRL" caption="" mask="0x1f000000"/>
          <bitfield name="OBUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="OMLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="OBUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUCMODE" offset="0x20" rw="RW" size="4" access-size="4" initval="0x40000040" caption="">
          <bitfield name="CVREG4OCTRL" caption="" mask="0x1f"/>
          <bitfield name="SUPFSM" caption="" mask="0xE0"/>
          <bitfield name="CVREG3OCTRL" caption="" mask="0x1f00"/>
          <bitfield name="CVREG2OCTROL" caption="" mask="0x1f0000"/>
          <bitfield name="ADCBOR" caption="" mask="0x200000"/>
          <bitfield name="BUCKBOR" caption="" mask="0x400000"/>
          <bitfield name="MLDOEXTBOR" caption="" mask="0x800000"/>
          <bitfield name="CVREG1OCTRL" caption="" mask="0x1f000000"/>
          <bitfield name="CBUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="CMLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="CBUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUSTATUS" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PMUSTATUS" caption="" mask="0x1f"/>
          <bitfield name="WCMRM" caption="" mask="0x20"/>
          <bitfield name="PMUANA_BUCKBOR" caption="" mask="0x40"/>
          <bitfield name="BSSEDATA" caption="" mask="0xffff00"/>
          <bitfield name="BSSENUM" caption="" mask="0x7f000000"/>
          <bitfield name="BSSERR" caption="" mask="0x80000000"/>
        </register>
