Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register name="TC3WO0G3R" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G3" mask="0xf" values="TC3WO0G3_PINS"/>
        </register>
        <register name="TC3WO1G2R" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G2" mask="0xf" values="TC3WO1G2_PINS"/>
        </register>
        <register name="TC3WO1G4R" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G4" mask="0xf" values="TC3WO1G4_PINS"/>
        </register>
        <register name="TC4WO0G1R" offset="0xe8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0" caption="TC4/WO0G1" mask="0xf" values="TC4WO0G1_PINS"/>
        </register>
        <register name="TC4WO0G3R" offset="0xec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0" caption="TC4/WO0G3" mask="0xf" values="TC4WO0G3_PINS"/>
        </register>
        <register name="TC4WO1G2R" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1" caption="TC4/WO1G2" mask="0xf" values="TC4WO1G2_PINS"/>
        </register>
        <register name="TC4WO1G4R" offset="0xf4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1" caption="TC4/WO1G4" mask="0xf" values="TC4WO1G4_PINS"/>
        </register>
        <register name="TC5WO0G1R" offset="0xf8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0" caption="TC5/WO0G1" mask="0xf" values="TC5WO0G1_PINS"/>
        </register>
        <register name="TC5WO0G3R" offset="0xfc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0" caption="TC5/WO0G3" mask="0xf" values="TC5WO0G3_PINS"/>
        </register>
        <register name="TC5WO1G2R" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1" caption="TC5/WO1G2" mask="0xf" values="TC5WO1G2_PINS"/>
        </register>
        <register name="TC5WO1G4R" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1" caption="TC5/WO1G4" mask="0xf" values="TC5WO1G4_PINS"/>
        </register>
        <register name="TC6WO0G1R" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0" caption="TC6/WO0G1" mask="0xf" values="TC6WO0G1_PINS"/>
        </register>
        <register name="TC6WO0G3R" offset="0x10c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0" caption="TC6/WO0G3" mask="0xf" values="TC6WO0G3_PINS"/>
        </register>
        <register name="TC6WO1G2R" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1" caption="TC6/WO1G2" mask="0xf" values="TC6WO1G2_PINS"/>
        </register>
        <register name="TC6WO1G4R" offset="0x114" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1" caption="TC6/WO1G4" mask="0xf" values="TC6WO1G4_PINS"/>
        </register>
        <register name="TC7WO0G1R" offset="0x118" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0" caption="TC7/WO0G1" mask="0xf" values="TC7WO0G1_PINS"/>
        </register>
        <register name="TC7WO0G3R" offset="0x11c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0" caption="TC7/WO0G3" mask="0xf" values="TC7WO0G3_PINS"/>
        </register>
        <register name="TC7WO1G2R" offset="0x120" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1" caption="TC7/WO1G2" mask="0xf" values="TC7WO1G2_PINS"/>
        </register>
        <register name="TC7WO1G4R" offset="0x124" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1" caption="TC7/WO1G4" mask="0xf" values="TC7WO1G4_PINS"/>
        </register>
        <!-- Next lines are OUTPUT pin mappings -->
        <register name="RPA3G1R" offset="0x218" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G1R" caption="RPA3/G1" mask="0x1f" values="RPA3G1_PINS"/>
        </register>
        <register name="RPA3G2R" offset="0x21c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G2R" caption="RPA3/G2" mask="0x1f" values="RPA3G2_PINS"/>
        </register>
        <register name="RPA3G3R" offset="0x220" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G3R" caption="RPA3/G3" mask="0x1f" values="RPA3G3_PINS"/>
        </register>
        <register name="RPA4G2R" offset="0x224" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G2R" caption="RPA4/G2" mask="0x1f" values="RPA4G2_PINS"/>
        </register>
        <register name="RPA4G3R" offset="0x228" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G3R" caption="RPA4/G3" mask="0x1f" values="RPA4G3_PINS"/>
        </register>
        <register name="RPA4G4R" offset="0x22c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G4R" caption="RPA4/G4" mask="0x1f" values="RPA4G4_PINS"/>
        </register>
        <register name="RPA5G1R" offset="0x230" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G1R" caption="RPA5/G1" mask="0x1f" values="RPA5G1_PINS"/>
        </register>
        <register name="RPA5G3R" offset="0x234" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G3R" caption="RPA5/G3" mask="0x1f" values="RPA5G3_PINS"/>
        </register>
        <register name="RPA5G4R" offset="0x238" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G4R" caption="RPA5/G4" mask="0x1f" values="RPA5G4_PINS"/>
        </register>
        <register name="RPA6G1R" offset="0x23c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G1R" caption="RPA6/G1" mask="0x1f" values="RPA6G1_PINS"/>
        </register>
        <register name="RPA6G2R" offset="0x240" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G2R" caption="RPA6/G2" mask="0x1f" values="RPA6G2_PINS"/>
        </register>
