Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/atdf/PIC32CX5109BZ31032.atdf
        <register modes="COUNT16" name="COUNT" offset="0x14" rw="RW" access="RWSYNC" size="2" initval="0x0000" caption="COUNT16 Count">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register modes="COUNT32" name="COUNT" offset="0x14" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="COUNT32 Count">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="COUNT8" name="PER" offset="0x1B" rw="RW" access="WSYNC" size="1" initval="0xFF" caption="COUNT8 Period">
          <bitfield name="PER" caption="Period Value" mask="0xFF"/>
        </register>
        <register modes="COUNT8" name="CC" offset="0x1C" rw="RW" access="RWSYNC" size="1" count="2" initval="0x00" caption="COUNT8 Compare and Capture">
          <bitfield name="CC" caption="Counter/Compare Value" mask="0xFF"/>
        </register>
        <register modes="COUNT16" name="CC" offset="0x1C" rw="RW" access="RWSYNC" size="2" count="2" initval="0x0000" caption="COUNT16 Compare and Capture">
          <bitfield name="CC" caption="Counter/Compare Value" mask="0xFFFF"/>
        </register>
        <register modes="COUNT32" name="CC" offset="0x1C" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="COUNT32 Compare and Capture">
          <bitfield name="CC" caption="Counter/Compare Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="COUNT8" name="PERBUF" offset="0x2F" rw="RW" access="WSYNC" size="1" initval="0xFF" caption="COUNT8 Period Buffer">
          <bitfield name="PERBUF" caption="Period Buffer Value" mask="0xFF"/>
        </register>
        <register modes="COUNT8" name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="1" count="2" initval="0x00" caption="COUNT8 Compare and Capture Buffer">
          <bitfield name="CCBUF" caption="Counter/Compare Buffer Value" mask="0xFF"/>
        </register>
        <register modes="COUNT16" name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="2" count="2" initval="0x0000" caption="COUNT16 Compare and Capture Buffer">
          <bitfield name="CCBUF" caption="Counter/Compare Buffer Value" mask="0xFFFF"/>
        </register>
        <register modes="COUNT32" name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="COUNT32 Compare and Capture Buffer">
          <bitfield name="CCBUF" caption="Counter/Compare Buffer Value" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="TC_CTRLA__CAPTMODE0">
        <value name="DEFAULT" caption="Default capture" value="0"/>
        <value name="CAPTMIN" caption="Minimum capture" value="1"/>
        <value name="CAPTMAX" caption="Maximum capture" value="2"/>
      </value-group>
      <value-group name="TC_CTRLA__CAPTMODE1">
        <value name="DEFAULT" caption="Default capture" value="0"/>
        <value name="CAPTMIN" caption="Minimum capture" value="1"/>
        <value name="CAPTMAX" caption="Maximum capture" value="2"/>
      </value-group>
      <value-group name="TC_CTRLA__MODE">
        <value name="COUNT16" caption="Counter in 16-bit mode" value="0"/>
        <value name="COUNT8" caption="Counter in 8-bit mode" value="1"/>
        <value name="COUNT32" caption="Counter in 32-bit mode" value="2"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCALER">
        <value name="DIV1" caption="Prescaler: GCLK_TC" value="0"/>
        <value name="DIV2" caption="Prescaler: GCLK_TC/2" value="1"/>
        <value name="DIV4" caption="Prescaler: GCLK_TC/4" value="2"/>
        <value name="DIV8" caption="Prescaler: GCLK_TC/8" value="3"/>
        <value name="DIV16" caption="Prescaler: GCLK_TC/16" value="4"/>
        <value name="DIV64" caption="Prescaler: GCLK_TC/64" value="5"/>
        <value name="DIV256" caption="Prescaler: GCLK_TC/256" value="6"/>
        <value name="DIV1024" caption="Prescaler: GCLK_TC/1024" value="7"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset the counter on next generic clock" value="0"/>
        <value name="PRESC" caption="Reload or reset the counter on next prescaler clock" value="1"/>
        <value name="RESYNC" caption="Reload or reset the counter on next generic clock and reset the prescaler counter" value="2"/>
      </value-group>
      <value-group name="TC_CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force a stop" value="2"/>
        <value name="UPDATE" caption="Force update of double-buffered register" value="3"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
      </value-group>
      <value-group name="TC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force a stop" value="2"/>
        <value name="UPDATE" caption="Force update of double-buffered register" value="3"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
      </value-group>
      <value-group name="TC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger TC on event" value="1"/>
        <value name="COUNT" caption="Count on event" value="2"/>
        <value name="START" caption="Start TC on event" value="3"/>
        <value name="STAMP" caption="Time stamp capture" value="4"/>
        <value name="PPW" caption="Period catured in CC0, pulse width in CC1" value="5"/>
        <value name="PWP" caption="Period catured in CC1, pulse width in CC0" value="6"/>
        <value name="PW" caption="Pulse width capture" value="7"/>
      </value-group>
